## MultiIndex DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
address = [
    ("101 Hanumanpet","Hyderabad","TS", "500047"),
    ("102 Marredpally", "Secunderabad", "TS", "500026"),
    ("103 Musheerabad", "Hyderabad", "TS", "500020")
]

In [3]:
pd.MultiIndex.from_tuples(address)
pd.MultiIndex.from_tuples(tuples=address)

MultiIndex([( '101 Hanumanpet',    'Hyderabad', 'TS', '500047'),
            ('102 Marredpally', 'Secunderabad', 'TS', '500026'),
            ('103 Musheerabad',    'Hyderabad', 'TS', '500020')],
           )

In [6]:
row_index = pd.MultiIndex.from_tuples(tuples=address, names=["Street", "City", "State", "Pincode"])

In [8]:
data = [
    ["A", "B"],
    ["C", "D"],
    ["E", "F"]
]

In [9]:
pd.DataFrame(data=data, index=row_index)

                                            0  1
Street          City         State Pincode
101 Hanumanpet  Hyderabad    TS    500047   A  B
102 Marredpally Secunderabad TS    500026   C  D
103 Musheerabad Hyderabad    TS    500020   E  F

In [10]:
columns = ["Schools", "Cost of Living"]

In [12]:
area_grades=pd.DataFrame(
    data = data,
    index = row_index,
    columns = columns
)
area_grades

                                           Schools Cost of Living
Street          City         State Pincode
101 Hanumanpet  Hyderabad    TS    500047        A              B
102 Marredpally Secunderabad TS    500026        C              D
103 Musheerabad Hyderabad    TS    500020        E              F

In [ ]:
data = [
    ["A", "C", "B", "D"],
    ["E", "G", "H", "F"],
    ["J", "L", "I", "K"]
]

In [14]:
column_index = pd.MultiIndex.from_tuples([
    ('Culture', 'Restaurants'),
    ('Culture', 'Museums'),
    ('Services', 'Police'),
    ('Services', 'Schools')
])

In [15]:
area_grades = pd.DataFrame(
    data = data,
    index = row_index,
    columns= column_index
)
area_grades

                                               Culture         Services  \
                                           Restaurants Museums   Police
Street          City         State Pincode
101 Hanumanpet  Hyderabad    TS    500047            A       C        B
102 Marredpally Secunderabad TS    500026            E       G        H
103 Musheerabad Hyderabad    TS    500020            J       L        I


                                           Schools
Street          City         State Pincode
101 Hanumanpet  Hyderabad    TS    500047        D
102 Marredpally Secunderabad TS    500026        F
103 Musheerabad Hyderabad    TS    500020        K